---
title: 'Центр безопасности Azure для IoT: Настройка с помощью Sentinel (Предварительная версия) | Документация Майкрософт'
description: В этом разделе приведены инструкции по настройке Sentinel Azure для получения данных из центра безопасности Azure для решения IoT.
services: asc-for-iot
ms.service: asc-for-iot
documentationcenter: na
author: mlottner
manager: rkarlin
ms.subservice: asc-for-iot
ms.devlang: na
ms.topic: conceptual
ms.tgt_pltfrm: na
ms.workload: na
ms.date: 02/18/2020
ms.author: mlottner
ms.openlocfilehash: f6e7eddd6ddbcec61c3d8d173891cbc9abaaf08f
ms.sourcegitcommit: 6ee876c800da7a14464d276cd726a49b504c45c5
ms.translationtype: MT
ms.contentlocale: ru-RU
ms.lasthandoff: 02/19/2020
ms.locfileid: "77463184"
---
> [!IMPORTANT]
> Центр безопасности Azure для соединителя данных IoT в Azure в настоящее время находится в общедоступной предварительной версии.
> Эта функция предоставляется без соглашения об уровне обслуживания и не рекомендуется для рабочих нагрузок. Некоторые функции могут не поддерживаться или их возможности могут быть ограничены. Дополнительные сведения см. в статье [Дополнительные условия использования предварительных выпусков Microsoft Azure](https://azure.microsoft.com/support/legal/preview-supplemental-terms/).

# <a name="connect-your-data-from-azure-security-center-for-iot-to-azure-sentinel-preview"></a>Подключение данных из центра безопасности Azure для Azure для Интернета вещей с помощью Sentinel (Предварительная версия) 

В этом руководство вы узнаете, как подключить центр безопасности Azure к данным IoT в Azure Sentinel.  

> [!div class="checklist"]
> * Предварительные требования 
> * Параметры соединения
> * Log Analytics представление предупреждений 

Подключение оповещений из центра безопасности Azure для Интернета вещей и их потоковая передача непосредственно в Azure Sentinel.

## <a name="prerequisites"></a>Предварительные требования

- Необходимо иметь разрешения на **Чтение** и **запись** рабочей области.
- **Центр безопасности Azure для Интернета вещей** должен быть **включен** в соответствующих центрах Интернета вещей.
- У вас должны быть разрешения на **Чтение** и **запись** в **центре Интернета вещей Azure** , к которому вы хотите подключиться.
- У вас также должны быть разрешения на **Чтение** и **запись** в **группе ресурсов центра Интернета вещей Azure**.

> [!NOTE]
> Для отправки общих оповещений о ресурсах Azure необходимо, чтобы в вашей подписке была запущена лицензия "Стандартный уровень" центра безопасности Azure. Если требуется лицензирование уровня "бесплатный" для центра безопасности Azure для Интернета вещей, только оповещения центра безопасности Azure для Интернета вещей, связанные с IoT, будут перенаправлены в Azure Sentinel. 

## <a name="connect-to-azure-security-center-for-iot"></a>Подключение к центру безопасности Azure для Интернета вещей

1. В поле Sentinel Azure выберите **соединители данных** , а затем щелкните элемент **Центр безопасности Azure для IOT** .
1. В нижней правой области щелкните **открыть страницу соединителя**. 
1. Нажмите кнопку **подключить**рядом с каждой подпиской центра Интернета вещей, предупреждениями и оповещениями устройств, которые вы хотите передавать в метку Azure. 
    - Если центр безопасности Azure для Интернета вещей не включен в этом центре, вы увидите сообщение Enable Warning (включить предупреждение). Щелкните ссылку **Enable (включить** ), чтобы запустить службу. 
1. Вы можете решить, должны ли оповещения в центре безопасности Azure для Интернета вещей автоматически создавать инциденты в Azure Sentinel. В разделе **Создание инцидентов**выберите **включить** , чтобы включить стандартное правило аналитики для автоматического создания инцидентов на основе предупреждений, созданных в подключенной службе безопасности. Это правило можно изменять или изменять в разделе **аналитики** > **Активные** правила.

> [!NOTE]
>Обновление списка концентраторов после внесения изменений в подключение может занять 10 или более секунд. 

## <a name="log-analytics-alert-display"></a>Отображение предупреждений Log Analytics

Чтобы использовать соответствующую схему в Log Analytics, чтобы отобразить центр безопасности Azure для оповещений IoT, сделайте следующее:

1. Откройте **журналы** > **секуритинсигхтс** > **секуритялерт**или выполните поиск по запросу **секуритялерт**. 
2. Фильтр для просмотра оповещений, созданных центром безопасности Azure для Интернета вещей с помощью следующего фильтра ККЛ:

```kusto
SecurityAlert | where ProductName == "Azure Security Center for IoT"
``` 

### <a name="service-notes"></a>Заметки о службе

После подключения центра Интернета вещей данные концентратора доступны в Sentinel в течение приблизительно 15 минут позже.


## <a name="next-steps"></a>Следующие шаги

В этом документе вы узнали, как подключить службу "Центр безопасности Azure для Интернета вещей" к Azure Sentinel. Дополнительные сведения об обнаружении угроз и доступе к данным безопасности см. в следующих статьях:

- Узнайте, как использовать Sentinel Azure для [получения сведений о данных и потенциальных угроз](https://docs.microsoft.com/azure/sentinel/quickstart-get-visibility).

- Узнайте, как [получить доступ к данным безопасности IOT](how-to-security-data-access.md)