---
title: Azure Security Center для IoT-руководства по настройке с Azure Sentinel (предварительный просмотр) Документы Майкрософт
description: Объясняется, как настроить Azure Sentinel для получения данных из вашего решения Для Обработки Данных Azure.
services: asc-for-iot
ms.service: asc-for-iot
documentationcenter: na
author: mlottner
manager: rkarlin
ms.subservice: asc-for-iot
ms.devlang: na
ms.topic: conceptual
ms.tgt_pltfrm: na
ms.workload: na
ms.date: 02/18/2020
ms.author: mlottner
ms.openlocfilehash: 082b33332051fee9da2aebe63b0c41edb300afaf
ms.sourcegitcommit: 2ec4b3d0bad7dc0071400c2a2264399e4fe34897
ms.translationtype: MT
ms.contentlocale: ru-RU
ms.lasthandoff: 03/28/2020
ms.locfileid: "78303551"
---
> [!IMPORTANT]
> Центр безопасности Данных Azure для разъема данных IoT в Azure Sentinel в настоящее время находится в открытом доступе.
> Эта функция предоставляется без соглашения об уровне обслуживания, и она не рекомендуется для производственных нагрузок. Некоторые функции могут не поддерживаться или их возможности могут быть ограничены. Дополнительные сведения см. в статье [Дополнительные условия использования предварительных выпусков Microsoft Azure](https://azure.microsoft.com/support/legal/preview-supplemental-terms/).

# <a name="connect-your-data-from-azure-security-center-for-iot-to-azure-sentinel-preview"></a>Подключите данные из Центра безопасности Azure для IoT в Azure Sentinel (предварительный просмотр) 

В этом руководстве узнайте, как подключить центр безопасности Azure для данных IoT к Azure Sentinel.  

> [!div class="checklist"]
> * Предварительные требования 
> * Параметры подключения
> * Представление оповещения «Аналитика журнала» 

Подключите оповещения из Центра безопасности Azure для IoT и поток их непосредственно в Azure Sentinel.

## <a name="prerequisites"></a>Предварительные требования

- Разрешения на чтение и **запись** Рабочего пространства должны **иметь** рабочее пространство.
- **Центр безопасности Azure для IoT** должен быть **включен** в соответствующий концентратор IoT.
- Вы должны иметь разрешения на **чтение** и **запись** в **центре Azure IoT,** который вы хотите подключить.
- Вы также должны **прочитать** и **написать** разрешения в **группе ресурсов Azure IoT Hub.**

> [!NOTE]
> Необходимо, чтобы в подписке работало лицензирование стандартного уровня Azure Security Center Standard для отправки общих оповещений ресурсов Azure. При бесплатном лицензировании уровня, необходимого для Центра безопасности Azure для IoT, только Центр безопасности Azure для оповещений, связанных с IoT, будет перенаправлен в Azure Sentinel. 

## <a name="connect-to-azure-security-center-for-iot"></a>Подключение к Центру безопасности Azure для IoT

1. В Azure Sentinel выберите **разъемы данных,** а затем щелкните **в Центре безопасности Azure для** плитки IoT.
1. С нижней части правой панели, нажмите **Открытая страница разъема**. 
1. Нажмите **Connect**, рядом с каждой подпиской IoT концентратор, чьи оповещения и оповещения устройства вы хотите поток в Azure Sentinel. 
    - Если центр безопасности Azure для IoT не включен в этот концентратор, вы увидите предупреждающее сообщение включить. Нажмите на ссылку **Enable,** чтобы запустить и включить службу. 
1. Вы можете решить, нужны ли оповещения из Центра безопасности Azure для IoT для автоматической генерации инцидентов в Azure Sentinel. В случае **создания**выберите **Включить** правило для автоматического создания инцидентов из генерируемых оповещений.  Это правило может быть изменено или отредактировано в **соответствии** > с правилами Analytics**Active.**

> [!NOTE]
>Обновление списка концентраторов после внесения изменений в соединение может занять 10 секунд или более. 

## <a name="log-analytics-alert-display"></a>Дисплей оповещения «Аналитика журнала»

Использовать соответствующую схему в журнале Analytics для отображения центра безопасности Azure для Оповещений IoT:

1. Открыть **журналы** > **SecurityInsights** > **SecurityAlert**, или поиск **SecurityAlert**. 
2. Фильтр, чтобы видеть только Центр безопасности Azure для создаваемых IoT оповещений с помощью следующего фильтра kql:

```kusto
SecurityAlert | where ProductName == "Azure Security Center for IoT"
``` 

### <a name="service-notes"></a>Служебные примечания

После подключения концентратора IoT данные концентратора доступны в Azure Sentinel примерно через 15 минут.


## <a name="next-steps"></a>Дальнейшие действия

В этом документе вы узнали, как подключить Центр безопасности Azure для IoT к Azure Sentinel. Чтобы узнать больше об обнаружении угроз и доступе к данным безопасности, смотрите следующие статьи:

- Узнайте, как использовать Azure Sentinel для [получения видимости ваших данных и потенциальных угроз.](https://docs.microsoft.com/azure/sentinel/quickstart-get-visibility)

- Узнайте, как получить доступ к [данным безопасности IoT](how-to-security-data-access.md)