---
title: Настройка Sentinel Azure для защитника для Интернета вещей (Предварительная версия)
description: В этой статье объясняется, как настроить метку Azure для получения данных из вашего защитника для решения IoT.
services: defender-for-iot
ms.service: defender-for-iot
documentationcenter: na
author: shhazam-ms
manager: rkarlin
ms.devlang: na
ms.topic: how-to
ms.tgt_pltfrm: na
ms.workload: na
ms.date: 12/16/2020
ms.author: shhazam
ms.openlocfilehash: c033f6fc6f3fc40005d98bd48832c15792d6f484
ms.sourcegitcommit: 8c3a656f82aa6f9c2792a27b02bbaa634786f42d
ms.translationtype: MT
ms.contentlocale: ru-RU
ms.lasthandoff: 12/17/2020
ms.locfileid: "97629091"
---
# <a name="connect-your-data-from-defender-for-iot-to-azure-sentinel-preview"></a>Подключение данных из защитника для Интернета вещей к Azure Sentinel (Предварительная версия)

> [!IMPORTANT]
> В настоящее время в общедоступной предварительной версии соединитель данных защитника для Интернета вещей находится в режиме " Эта функция предоставляется без соглашения об уровне обслуживания и не рекомендуется для рабочих нагрузок. Некоторые функции могут не поддерживаться или их возможности могут быть ограничены. Дополнительные сведения см. в статье [Дополнительные условия использования предварительных выпусков Microsoft Azure](https://azure.microsoft.com/support/legal/preview-supplemental-terms/).

Используйте соединитель защитник для IoT для потоковой передачи всех событий вашего защитника в Azure Sentinel. 

Такая интеграция позволяет организациям быстро обнаруживать многоступенчатыхные атаки, которые часто пересекаются с границами. Кроме того, защитник для интеграции IoT с возможностями оркестрации в отношении безопасности, автоматизации и реагирования Azure Sentinel (ВЗЛЕТЕЛ) обеспечивает автоматический отклик и предотвращение с помощью встроенных оптимизированных модули PlayBook. 

## <a name="prerequisites"></a>Предварительные требования

- Разрешения на **Чтение** и **запись** в рабочей области, на которой развернута Sentinel Azure
- **Защитник для Интернета вещей** должен быть **включен** в соответствующих центрах Интернета вещей
- У вас должны быть разрешения **участника** на **подписку** , которую вы хотите подключить.

## <a name="connect-to-defender-for-iot"></a>Подключение к защитнику для Интернета вещей

1. В Azure Sentinel выберите **соединители данных** , а затем выберите **защитник для Интернета вещей** (по-прежнему может называться центр безопасности Azure для IOT) из коллекции.

1. В нижней части правой панели щелкните **открыть страницу соединителя**.

1. Нажмите кнопку **подключить** рядом с каждой подпиской центра Интернета вещей, предупреждениями и оповещениями устройств, которые вы хотите передавать в метку Azure.
    - Если защитник для IoT не включен по крайней мере в одном центре Интернета вещей в рамках подписки, появится сообщение об ошибке. Включите защитник для Интернета вещей в центре Интернета вещей, чтобы устранить эту ошибку.

1. Вы можете решить, должны ли оповещения из защитника для Интернета вещей автоматически создавать инциденты в Azure Sentinel. В разделе **Создание инцидентов** выберите **включить** , чтобы включить правило аналитики по умолчанию для автоматического создания инцидентов на основе созданных оповещений. Это правило можно изменить или изменить в разделе **аналитика**  >  **активные правила**.

> [!NOTE]
> Обновление списка **подписки** может занять 10 секунд после внесения изменений в соединение. 

## <a name="log-analytics-alert-view"></a>Log Analytics представление предупреждений

Чтобы использовать соответствующую схему в Log Analytics, чтобы отобразить защитник для оповещений IoT, выполните следующие действия.

1. Откройте **журналы**  >  **секуритинсигхтс**  >  **секуритялерт** или выполните поиск по запросу **секуритялерт**.

1. Фильтр, чтобы просмотреть оповещения только для защитника, созданные IoT, с помощью следующего фильтра ККЛ:

```kusto
SecurityAlert | where ProductName == "Azure Security Center for IoT"
```

### <a name="service-notes"></a>Заметки о службе

После подключения **подписки** данные концентратора доступны в Azure Sentinel примерно через 15 минут позже.

## <a name="next-steps"></a>Дальнейшие действия

В этом документе вы узнали, как подключить защитник для Интернета вещей к Azure Sentinel. Дополнительные сведения об обнаружении угроз и доступе к данным безопасности см. в следующих статьях:

- Узнайте, как использовать Sentinel Azure для [получения сведений о данных и потенциальных угроз](https://docs.microsoft.com/azure/sentinel/quickstart-get-visibility).
- Узнайте, как [получить доступ к данным безопасности IOT](how-to-security-data-access.md)
