---
title: Подключение к Azure "Центр безопасности Azure для Интернета вещей" | Документация Майкрософт
description: Сведения о подключении центра безопасности Azure для данных IoT к Azure Sentinel.
services: sentinel
documentationcenter: na
author: yelevin
manager: rkarlin
editor: ''
ms.service: azure-sentinel
ms.subservice: azure-sentinel
ms.devlang: na
ms.topic: conceptual
ms.tgt_pltfrm: na
ms.workload: na
ms.date: 02/18/2020
ms.author: yelevin
ms.openlocfilehash: 3af51110a4c4604444573f62be65077c786db606
ms.sourcegitcommit: 877491bd46921c11dd478bd25fc718ceee2dcc08
ms.contentlocale: ru-RU
ms.lasthandoff: 07/02/2020
ms.locfileid: "77588643"
---
# <a name="connect-your-data-from-azure-security-center-for-iot-to-azure-sentinel"></a>Подключение данных из центра безопасности Azure для Azure IoT к Sentinel 


> [!IMPORTANT]
> Центр безопасности Azure для соединителя данных IoT сейчас находится в общедоступной предварительной версии. Эта функция предоставляется без соглашения об уровне обслуживания и не рекомендуется для рабочих нагрузок. Некоторые функции могут не поддерживаться или их возможности могут быть ограничены. Дополнительные сведения см. в статье [Дополнительные условия использования предварительных выпусков Microsoft Azure](https://azure.microsoft.com/support/legal/preview-supplemental-terms/).

Используйте центр безопасности Azure для соединителя IoT, чтобы передать весь центр безопасности Azure для событий IoT в Azure Sentinel. 

## <a name="prerequisites"></a>Предварительные условия

- Разрешения на **Чтение** и **запись** в рабочей области, на которой развернута Sentinel Azure
- **Центр безопасности Azure для Интернета вещей** должен быть **включен** в соответствующих центрах Интернета вещей
- Разрешения на **Чтение** и **запись** в **центре Интернета вещей Azure** , к которому вы хотите подключиться.
- Разрешения на **Чтение** и **запись** в **группе ресурсов центра Интернета вещей Azure**

> [!NOTE]
> Хотя вы должны включить лицензию уровня " **стандартный** " центра безопасности Azure в подписке для потоковой передачи оповещений о ресурсах IOT в Azure Sentinel, необходимо включить лицензию " **бесплатный** уровень центра безопасности Azure" в подписке, чтобы просмотреть центр безопасности Azure для оповещений IOT в Azure Sentinel. 

## <a name="connect-to-azure-security-center-for-iot"></a>Подключение к центру безопасности Azure для Интернета вещей

1. В поле Sentinel Azure выберите **соединители данных** , а затем щелкните элемент **Центр безопасности Azure для IOT** .
1. В нижней правой области щелкните **открыть страницу соединителя**. 
1. Нажмите кнопку **подключить**рядом с каждой подпиской центра Интернета вещей, предупреждениями и оповещениями устройств, которые вы хотите передавать в метку Azure. 
    - Если центр безопасности Azure для Интернета вещей не включен в этом центре, вы увидите сообщение Enable Warning ( **включить** предупреждение). Щелкните ссылку **Enable (включить** ), чтобы запустить службу. 
1. Вы можете решить, должны ли оповещения в центре безопасности Azure для Интернета вещей автоматически создавать инциденты в Azure Sentinel. В разделе **Создание инцидентов**выберите **включить** , чтобы включить стандартное правило аналитики для автоматического создания инцидентов на основе предупреждений, созданных в подключенной службе безопасности. Это правило можно изменить или изменить в разделе **аналитика**  >  **Активные** правила.

> [!NOTE]
> Обновление списка концентраторов может занять некоторое время после внесения изменений в соединение. 

## <a name="log-analytics-alert-display"></a>Отображение предупреждений Log Analytics

Чтобы использовать соответствующую схему в Log Analytics, чтобы отобразить центр безопасности Azure для оповещений IoT, сделайте следующее:

1. Откройте **журналы**  >  **секуритинсигхтс**  >  **секуритялерт**или выполните поиск по запросу **секуритялерт**. 
2. Фильтр для просмотра оповещений, созданных центром безопасности Azure для Интернета вещей с помощью следующего фильтра ККЛ:

```kusto
SecurityAlert | where ProductName == "Azure Security Center for IoT"
``` 

### <a name="service-notes"></a>Заметки о службе

После подключения центра Интернета вещей данные концентратора доступны в Sentinel в течение приблизительно 15 минут позже.


## <a name="next-steps"></a>Дальнейшие шаги

В этом документе вы узнали, как подключить центр безопасности Azure для данных IoT к Azure Sentinel. Ознакомьтесь с дополнительными сведениями об Azure Sentinel в соответствующих статьях.
- Узнайте, как [отслеживать свои данные и потенциальные угрозы](quickstart-get-visibility.md).
- Узнайте, как приступить к [обнаружению угроз с помощью Azure Sentinel](tutorial-detect-threats-built-in.md).
- [Используйте книги](tutorial-monitor-your-data.md) для мониторинга данных.
