---
title: Подключение Trend Micro Типпингпоинт к Azure Sentinel | Документация Майкрософт
description: Узнайте, как использовать соединитель данных Trend Micro Типпингпоинт для извлечения журналов SMS Типпингпоинт в Azure Sentinel. Просмотр данных Типпингпоинт в книгах, создание оповещений и улучшение расследования.
services: sentinel
documentationcenter: na
author: yelevin
manager: rkarlin
editor: ''
ms.assetid: 0001cad6-699c-4ca9-b66c-80c194e439a5
ms.service: azure-sentinel
ms.subservice: azure-sentinel
ms.devlang: na
ms.topic: how-to
ms.tgt_pltfrm: na
ms.workload: na
ms.date: 01/12/2021
ms.author: yelevin
ms.openlocfilehash: 549b4e1e5e1aef3f6957fa52d69d252c55934286
ms.sourcegitcommit: 949c0a2b832d55491e03531f4ced15405a7e92e3
ms.translationtype: MT
ms.contentlocale: ru-RU
ms.lasthandoff: 01/18/2021
ms.locfileid: "98541599"
---
# <a name="connect-your-trend-micro-tippingpoint-solution-to-azure-sentinel"></a>Подключение решения Trend Micro Типпингпоинт к Azure Sentinel

> [!IMPORTANT]
> Соединитель Trend Micro Типпингпоинт в настоящее время находится на **этапе предварительной версии**. Ознакомьтесь с дополнительными [условиями использования Microsoft Azure](https://azure.microsoft.com/support/legal/preview-supplemental-terms/) предварительных версий для дополнительных юридических условий, которые относятся к функциям Azure, которые доступны в бета-версии, предварительном просмотре или еще не выпущены в общедоступную версию.

В этой статье объясняется, как подключить решение системы защиты от угроз Trend Micro Типпингпоинт к Azure Sentinel. Соединитель данных Trend Micro Типпингпоинт позволяет легко подключать журналы системы управления безопасностью Типпингпоинт (SMS) с помощью Sentinel Azure, чтобы можно было просматривать данные в книгах, использовать их для создания пользовательских оповещений и внедрять их для улучшения расследования. 

> [!NOTE]
> Данные будут храниться в географическом расположении рабочей области, на которой вы используете метку Azure.

## <a name="prerequisites"></a>Предварительные требования

- У вас должны быть разрешения на чтение и запись в рабочей области Sentinel Azure.

- Необходимо иметь разрешения на чтение общих ключей для рабочей области.

## <a name="send-trend-micro-tippingpoint-logs-to-azure-sentinel"></a>Отправка журналов трендов Micro Типпингпоинт в Azure Sentinel

Чтобы получить журналы в Azure Sentinel, настройте решение Типпингпоинт TPS для отправки сообщений Syslog в формате CEF на сервер пересылки журналов на основе Linux (под управлением rsyslog или syslog-ng). На этом сервере будет установлен агент Log Analytics, а агент перенаправит журналы в рабочую область Sentinel Azure.

1. В меню навигации меток Azure выберите **соединители данных**.

1. В коллекции **соединителей данных** выберите **Trend Micro типпингпоинт (Предварительная версия)**, а затем **откройте страницу соединителя**.

1. Следуйте инструкциям на вкладке **инструкции** в разделе **Конфигурация**.

    1. **1. Конфигурация агента syslog для Linux.** выполните этот шаг, если у вас еще нет запущенной службы пересылки журналов или если вам требуется еще одна служба. Более подробные инструкции и пояснения см. в разделе [Шаг 1. Развертывание сервера пересылки журналов](connect-cef-agent.md) в документации по Sentinel Azure.

    1. **2. Пересылка журналов SMS для Micro типпингпоинт в агент системного журнала.** эта конфигурация должна включать следующие элементы:
        - Назначение журнала — имя узла и/или IP-адрес сервера пересылки журналов.
        - Протокол и порт — **TCP 514** (если в противном случае это не рекомендуется, обязательно выполните параллельное изменение в управляющей программе syslog на сервере пересылки журналов).
        - Формат журнала — **ARCSIGHT CEF Format v 4.2**
        - Типы журналов — все доступные

    1. **3. Проверка подключения** . Проверка приема данных путем копирования команды на страницу соединителя и запуска ее на сервере пересылки журналов. Более подробные инструкции и пояснения см. в разделе [Шаг 3. Проверка подключения](connect-cef-verify.md) в документации Azure Sentinel.

        После того, как журналы начнут отображаться в Log Analytics, может пройти до 20 минут.

## <a name="find-your-data"></a>Поиск данных

После установки успешного подключения данные отображаются в **журналах** в разделе " **Sentinel** " в таблице *CommonSecurityLog* .

Чтобы запросить данные TrendMicro Типпингпоинт в Log Analytics, скопируйте следующий фрагмент в окно запроса, применяя другие фильтры по своему выбору:

```kusto
CommonSecurityLog 
| where DeviceVendor == "TrendMicroTippingPoint"
```

Дополнительные примеры запросов см. на вкладке **дальнейшие действия** на странице соединителя.

## <a name="next-steps"></a>Дальнейшие действия

В этом документе вы узнали, как подключить Trend Micro Типпингпоинт к Azure Sentinel. Ознакомьтесь с дополнительными сведениями об Azure Sentinel в соответствующих статьях.
- Узнайте, как [отслеживать свои данные и потенциальные угрозы](quickstart-get-visibility.md).
- Узнайте, как приступить к [обнаружению угроз с помощью Azure Sentinel](tutorial-detect-threats-built-in.md).
- [Используйте книги](tutorial-monitor-your-data.md) для мониторинга данных.