---
title: Подключите Центр безопасности Azure для IoT в Azure Sentinel Документы Майкрософт
description: Узнайте, как подключить Центр безопасности Azure для данных IoT к Данным Azure Sentinel.
services: sentinel
documentationcenter: na
author: yelevin
manager: rkarlin
editor: ''
ms.service: azure-sentinel
ms.subservice: azure-sentinel
ms.devlang: na
ms.topic: conceptual
ms.tgt_pltfrm: na
ms.workload: na
ms.date: 02/18/2020
ms.author: yelevin
ms.openlocfilehash: 3af51110a4c4604444573f62be65077c786db606
ms.sourcegitcommit: 2ec4b3d0bad7dc0071400c2a2264399e4fe34897
ms.translationtype: MT
ms.contentlocale: ru-RU
ms.lasthandoff: 03/28/2020
ms.locfileid: "77588643"
---
# <a name="connect-your-data-from-azure-security-center-for-iot-to-azure-sentinel"></a>Подключите данные из Центра безопасности Azure для IoT в Azure Sentinel 


> [!IMPORTANT]
> Центр безопасности Данных Azure для разъема данных IoT в настоящее время находится в открытом доступе. Эта функция предоставляется без соглашения об уровне обслуживания, и она не рекомендуется для производственных нагрузок. Некоторые функции могут не поддерживаться или их возможности могут быть ограничены. Дополнительные сведения см. в статье [Дополнительные условия использования предварительных выпусков Microsoft Azure](https://azure.microsoft.com/support/legal/preview-supplemental-terms/).

Используйте центр безопасности Azure для разъема IoT для потоковой передачи всех событий Azure для Событий ВАшего рациона в Azure Sentinel. 

## <a name="prerequisites"></a>Предварительные требования

- **Прочитайте** и **напишите** разрешения на рабочее пространство, на котором развернут Azure Sentinel
- **Центр безопасности Azure для IoT** должен быть **включен** в соответствующий концентратор IoT (ы)
- **Прочитайте** и **записывайте** разрешения в **центре Azure IoT,** который вы хотите подключить
- **Чтение** и **запись** разрешений в **группе ресурсов Azure IoT концентратора**

> [!NOTE]
> Несмотря на то, что **Standard** необходимо включить в подписку на службу ожидания ресурса IoT для потоковой передачи оповещений о ресурсах IoT в Azure Sentinel, необходимо включить в подписку **бесплатную** лицензию Центра безопасности Azure для просмотра оповещений Оповещений Оповещений ВИзу. 

## <a name="connect-to-azure-security-center-for-iot"></a>Подключение к Центру безопасности Azure для IoT

1. В Azure Sentinel выберите **разъемы данных,** а затем щелкните **в Центре безопасности Azure для** плитки IoT.
1. С нижней правой панели, нажмите **Открытая страница разъема**. 
1. Нажмите **Connect**, рядом с каждой подпиской IoT концентратор, чьи оповещения и оповещения устройства вы хотите поток в Azure Sentinel. 
    - Если центр безопасности Azure для IoT не включен в этот концентратор, вы увидите предупреждающее сообщение **включить.** Нажмите на ссылку **Enable,** чтобы запустить службу. 
1. Вы можете решить, нужны ли оповещения из Центра безопасности Azure для IoT для автоматической генерации инцидентов в Azure Sentinel. В случае **возникновения инцидентов**выберите **Enable,** чтобы включить аналитическое правило по умолчанию для автоматического создания инцидентов из предупреждений, генерируемых в подключенной службе безопасности. Это правило может быть изменено или отредактировано в **соответствии** > с правилами Analytics**Active.**

> [!NOTE]
> Обновление списка концентраторов после внесения изменений в соединение может занять некоторое время. 

## <a name="log-analytics-alert-display"></a>Дисплей оповещения «Аналитика журнала»

Использовать соответствующую схему в журнале Analytics для отображения центра безопасности Azure для Оповещений IoT:

1. Открыть **журналы** > **SecurityInsights** > **SecurityAlert**, или поиск **SecurityAlert**. 
2. Фильтр, чтобы видеть только Центр безопасности Azure для создаваемых IoT оповещений с помощью следующего фильтра kql:

```kusto
SecurityAlert | where ProductName == "Azure Security Center for IoT"
``` 

### <a name="service-notes"></a>Служебные примечания

После подключения концентратора IoT данные концентратора доступны в Azure Sentinel примерно через 15 минут.


## <a name="next-steps"></a>Дальнейшие действия

В этом документе вы узнали, как подключить Центр безопасности Azure для данных IoT к Azure Sentinel. Ознакомьтесь с дополнительными сведениями об Azure Sentinel в соответствующих статьях.
- Узнайте, как [отслеживать свои данные и потенциальные угрозы](quickstart-get-visibility.md).
- Узнайте, как приступить к [обнаружению угроз с помощью Azure Sentinel](tutorial-detect-threats-built-in.md).
- [Используйте трудовые книжки](tutorial-monitor-your-data.md) для мониторинга данных.
