---
title: Подключение необработанных данных защитника Microsoft 365 к Azure Sentinel | Документация Майкрософт
description: Узнайте, как принимать необработанные данные о событиях из защитника Microsoft 365 в Azure Sentinel.
services: sentinel
documentationcenter: na
author: yelevin
manager: rkarlin
editor: ''
ms.service: azure-sentinel
ms.subservice: azure-sentinel
ms.devlang: na
ms.topic: conceptual
ms.tgt_pltfrm: na
ms.workload: na
ms.date: 10/13/2019
ms.author: yelevin
ms.openlocfilehash: e9e892ae08c65ee5c5008bbdc1b419d8dec30183
ms.sourcegitcommit: 829d951d5c90442a38012daaf77e86046018e5b9
ms.translationtype: MT
ms.contentlocale: ru-RU
ms.lasthandoff: 10/09/2020
ms.locfileid: "90938479"
---
# <a name="connect-data-from-microsoft-365-defender-to-azure-sentinel"></a>Подключение данных из защитника Microsoft 365 к Azure Sentinel

> [!IMPORTANT]
>
> **Защитник Microsoft 365** ранее назывался **Microsoft Threat protection** или **MTP**.
>
> **Защитник Майкрософт для конечной точки** ранее назывался **Microsoft Defender Advanced Threat protection** или **мдатп**.
>
> Вы можете увидеть, что старые имена по-прежнему используются в течение определенного периода времени.

## <a name="background"></a>История

Новый соединитель [защитника Microsoft 365](https://docs.microsoft.com/microsoft-365/security/mtp/microsoft-threat-protection) позволяет выполнять потоковую передачу **расширенных** журналов подразделений — тип данных необработанных событий — от Microsoft 365 защитника до Azure Sentinel. 

С интеграцией [защитника Майкрософт для конечной точки (мдатп)](https://docs.microsoft.com/windows/security/threat-protection/microsoft-defender-atp/microsoft-defender-advanced-threat-protection) в защищенный тег безопасности защитника Microsoft 365 теперь вы можете собирать свои события защитника Майкрософт для [расширенного](https://aka.ms/mdatpAH) поисковых событий конечной точки с помощью соединителя Microsoft 365 Defender, а также выполнять потоковую передачу в новые встроенные таблицы в рабочей области Sentinel Azure. Эти таблицы построены на той же схеме, которая используется на портале защитника Microsoft 365, что дает вам полный доступ к набору расширенных журналов подсчета и позволяет выполнять следующие действия:

- Вы сможете легко скопировать существующий расширенный поисковый запрос ATP в защитнике Майкрософт в Azure Sentinel.

- Используйте необработанные журналы событий для предоставления дополнительных сведений о предупреждениях, поиске и исследовании, а также для сопоставления событий с данными из дополнительных источников данных в Azure Sentinel.

- Храните журналы с увеличением срока хранения, помимо защитника Майкрософт для конечной точки или срока хранения по умолчанию для защитника Microsoft 365 в течение 30 дней. Это можно сделать, настроив хранение рабочей области или настроив хранение для каждой таблицы в Log Analytics.

> [!IMPORTANT]
>
> Соединитель защитника Microsoft 365 в настоящее время находится в общедоступной предварительной версии. Эта функция предоставляется без соглашения об уровне обслуживания и не рекомендуется для рабочих нагрузок. Дополнительные сведения см. в статье [Дополнительные условия использования предварительных выпусков Microsoft Azure](https://azure.microsoft.com/support/legal/preview-supplemental-terms/).

## <a name="prerequisites"></a>Предварительные требования

- Необходимо иметь действительную лицензию для защитника Майкрософт для конечной точки, как описано в разделе [Настройка защитника Майкрософт для развертывания конечных точек](https://docs.microsoft.com/windows/security/threat-protection/microsoft-defender-atp/licensing). 

- Пользователю должна быть назначена роль глобального администратора в клиенте (в Azure Active Directory).

## <a name="connect-to-microsoft-365-defender"></a>Подключение к защитнику Microsoft 365

Если защитник Майкрософт для конечной точки развернут и принимает данные, журналы событий можно легко передать в Azure Sentinel.

1. В качестве метки Azure выберите **соединители данных**, **Microsoft 365 защитник (Предварительная версия)** из коллекции и щелкните **открыть страницу соединителя**.

1. Следующие типы событий можно собирать из соответствующих расширенных таблиц. Установите флажки для типов событий, которые вы хотите получать:

    | Тип событий | Имя таблицы |
    |-|-|
    | Сведения о компьютере (включая сведения о ОС) | DeviceInfo |
    | Свойства сети компьютеров | девиценетворкинфо |
    | Создание процессов и связанные события | девицепроцессевентс |
    | Сетевое подключение и связанные события | девиценетворкевентс |
    | Создание, изменение и другие события файловой системы | девицефиливентс |
    | Создание и изменение записей реестра | девицерегистревентс |
    | Входы и другие события проверки подлинности | девицелогоневентс |
    | События загрузки DLL | девицеимажелоадевентс |
    | Дополнительные типы событий | девицеевентс |
    |

1. Щелкните **Применить изменения**. 

1. Чтобы запросить дополнительные таблицы поиска в Log Analytics, введите имя таблицы из списка выше в окне запроса.

## <a name="verify-data-ingestion"></a>Проверка приема данных

Диаграмма данных на странице соединитель указывает на то, что вы принимаете данные. Вы заметите, что в нем отображается одна строка, которая объединяет объем событий во всех включенных таблицах. После включения соединителя можно использовать следующий запрос ККЛ, чтобы создать аналогичную диаграмму объема событий для одной таблицы (измените таблицу *девицеевентс* на нужную таблицу по своему усмотрению):

```kusto
let Now = now();
(range TimeGenerated from ago(14d) to Now-1d step 1d
| extend Count = 0
| union isfuzzy=true (
    DeviceEvents
    | summarize Count = count() by bin_at(TimeGenerated, 1d, Now)
)
| summarize Count=max(Count) by bin_at(TimeGenerated, 1d, Now)
| sort by TimeGenerated
| project Value = iff(isnull(Count), 0, Count), Time = TimeGenerated, Legend = "Events")
| render timechart
```

На вкладке **дальнейшие действия** вы найдете несколько примеров запросов, которые были добавлены. Их можно запустить в месте или изменить и сохранить.

## <a name="next-steps"></a>Дальнейшие шаги
В этом документе вы узнали, как получить необработанные данные о событиях из защитника Майкрософт для конечной точки в Azure Sentinel с помощью соединителя защитника Microsoft 365. Ознакомьтесь с дополнительными сведениями об Azure Sentinel в соответствующих статьях.
- Узнайте, как [отслеживать свои данные и потенциальные угрозы](quickstart-get-visibility.md).
- Узнайте, как приступить к [обнаружению угроз с помощью Azure Sentinel](tutorial-detect-threats.md).
