---
title: Подключение к Azure "защитник Azure для Интернета вещей" | Документация Майкрософт
description: Узнайте, как подключить Azure Defender (ранее — центр безопасности Azure) для данных IoT к Azure Sentinel.
services: sentinel
documentationcenter: na
author: yelevin
manager: rkarlin
editor: ''
ms.service: azure-sentinel
ms.subservice: azure-sentinel
ms.devlang: na
ms.topic: how-to
ms.tgt_pltfrm: na
ms.workload: na
ms.date: 12/16/2020
ms.author: yelevin
ms.openlocfilehash: 95e78c7557092a4d1203a8df3a107fe7b63eac9b
ms.sourcegitcommit: 8c3a656f82aa6f9c2792a27b02bbaa634786f42d
ms.translationtype: MT
ms.contentlocale: ru-RU
ms.lasthandoff: 12/17/2020
ms.locfileid: "97631447"
---
# <a name="connect-your-data-from-azure-defender-formerly-azure-security-center-for-iot-to-azure-sentinel"></a>Подключение данных из Azure Defender (прежнее название — центр безопасности Azure) для Azure IoT 


> [!IMPORTANT]
> В настоящее время в общедоступной предварительной версии соединитель данных защитника для Интернета вещей находится в режиме " Эта функция предоставляется без соглашения об уровне обслуживания и не рекомендуется для рабочих нагрузок. Некоторые функции могут не поддерживаться или их возможности могут быть ограничены. Дополнительные сведения см. в статье [Дополнительные условия использования предварительных выпусков Microsoft Azure](https://azure.microsoft.com/support/legal/preview-supplemental-terms/).

Используйте соединитель защитник для IoT для потоковой передачи всех событий вашего защитника в Azure Sentinel. 

Такая интеграция позволяет организациям быстро обнаруживать многоступенчатыхные атаки, которые часто пересекаются с границами. Кроме того, защитник для интеграции IoT с возможностями оркестрации в отношении безопасности, автоматизации и реагирования Azure Sentinel (ВЗЛЕТЕЛ) обеспечивает автоматический отклик и предотвращение с помощью встроенных оптимизированных модули PlayBook. 
## <a name="prerequisites"></a>Предварительные требования

- Разрешения на **Чтение** и **запись** в рабочей области, на которой развернута Sentinel Azure
- **Защитник для Интернета вещей** должен быть **включен** в соответствующих центрах Интернета вещей
- У вас должны быть разрешения **участника** на **подписку** , которую вы хотите подключить.

## <a name="connect-to-defender-for-iot"></a>Подключение к защитнику для Интернета вещей

1. В качестве метки Azure выберите **соединители данных** , а затем в коллекции щелкните **защитник для Интернета вещей** (может по-прежнему называться "Центр безопасности Azure для Интернета вещей").

1. В нижней части правой панели щелкните **открыть страницу соединителя**. 

1. Нажмите кнопку **подключить** рядом с каждой подпиской центра Интернета вещей, предупреждениями и оповещениями устройств, которые вы хотите передавать в метку Azure. 
    - Если защитник для IoT не включен по крайней мере в одном центре Интернета вещей в рамках подписки, появится сообщение об ошибке. Включите защитник для Интернета вещей в центре Интернета вещей, чтобы устранить эту ошибку.

1. Вы можете решить, должны ли оповещения из защитника для Интернета вещей автоматически создавать инциденты в Azure Sentinel. В разделе **Создание инцидентов** выберите **включить** , чтобы включить правило аналитики по умолчанию для автоматического создания инцидентов на основе созданных оповещений. Это правило можно изменить или изменить в разделе **аналитика**  >  **активные правила**.

> [!NOTE]
> Обновление списка **подписки** может занять 10 секунд после внесения изменений в соединение. 

## <a name="log-analytics-alert-view"></a>Log Analytics представление предупреждений

Чтобы использовать соответствующую схему в Log Analytics, чтобы отобразить защитник для оповещений IoT, выполните следующие действия.

1. Откройте **журналы**  >  **секуритинсигхтс**  >  **секуритялерт** или выполните поиск по запросу **секуритялерт**. 

2. Фильтр, чтобы просмотреть оповещения только для защитника, созданные IoT, с помощью следующего фильтра ККЛ:

```kusto
SecurityAlert | where ProductName == "Azure Security Center for IoT"
``` 

### <a name="service-notes"></a>Заметки о службе

После подключения **подписки** данные концентратора доступны в Azure Sentinel примерно через 15 минут позже.


## <a name="next-steps"></a>Дальнейшие действия

В этом документе вы узнали, как подключить защитник для Интернета вещей к Azure Sentinel. Ознакомьтесь с дополнительными сведениями об Azure Sentinel в соответствующих статьях.

- Узнайте, как [отслеживать свои данные и потенциальные угрозы](quickstart-get-visibility.md).
- Узнайте, как приступить к [обнаружению угроз с помощью Azure Sentinel](tutorial-detect-threats-built-in.md).
- [Используйте книги](tutorial-monitor-your-data.md) для мониторинга данных.
