---
title: Подключение Сикотик Secret Server к Azure Sentinel | Документация Майкрософт
description: Узнайте, как использовать соединитель данных Сикотик Secret Server для извлечения журналов Сикотик Secret Server в Azure Sentinel. Просмотр данных Сикотик Secret Server в книгах, создание оповещений и улучшение расследования.
services: sentinel
documentationcenter: na
author: yelevin
manager: rkarlin
editor: ''
ms.service: azure-sentinel
ms.subservice: azure-sentinel
ms.devlang: na
ms.topic: how-to
ms.tgt_pltfrm: na
ms.workload: na
ms.date: 12/13/2020
ms.author: yelevin
ms.openlocfilehash: a0056391dddec25511deb7033d37f59db3d835c8
ms.sourcegitcommit: ca215fa220b924f19f56513fc810c8c728dff420
ms.translationtype: MT
ms.contentlocale: ru-RU
ms.lasthandoff: 01/19/2021
ms.locfileid: "98567933"
---
# <a name="connect-your-thycotic-secret-server-to-azure-sentinel"></a>Подключение сервера Сикотик Secret к Azure Sentinel

> [!IMPORTANT]
> Соединитель Сикотик Secret Server сейчас находится на **этапе предварительной версии**. Ознакомьтесь с дополнительными [условиями использования Microsoft Azure](https://azure.microsoft.com/support/legal/preview-supplemental-terms/) предварительных версий для дополнительных юридических условий, которые относятся к функциям Azure, которые доступны в бета-версии, предварительном просмотре или еще не выпущены в общедоступную версию.

В этой статье объясняется, как подключить серверное устройство Сикотик Secret к Azure Sentinel. Соединитель данных Сикотик Secret Server позволяет легко подключать журналы Сикотик Secret Server с помощью Sentinel Azure, чтобы можно было просматривать данные в книгах, использовать их для создания пользовательских оповещений и внедрять их для улучшения расследования. Интеграция между Сикотик и Azure Sentinel использует соединитель данных CEF для правильного анализа и вывода сообщений системного журнала сервера.

> [!NOTE]
> Данные будут храниться в географическом расположении рабочей области, на которой вы используете метку Azure.

## <a name="prerequisites"></a>Предварительные требования

- У вас должны быть разрешения на чтение и запись в рабочей области Sentinel Azure.

- Необходимо иметь разрешения на чтение общих ключей для рабочей области.

- Сервер Сикотик Secret должен быть настроен для экспорта журналов через системный журнал.

## <a name="send-thycotic-secret-server-logs-to-azure-sentinel"></a>Отправка журналов Сикотик Secret Server в Azure Sentinel

Чтобы получить журналы в Azure Sentinel, настройте сервер Сикотик Secret для отправки сообщений Syslog в формате CEF на сервер пересылки журналов на основе Linux (под управлением rsyslog или syslog-ng). На этом сервере будет установлен агент Log Analytics, а агент перенаправит журналы в рабочую область Sentinel Azure.

1. В меню навигации меток Azure выберите **соединители данных**.

1. В коллекции **соединителей данных** выберите **сикотик Secret Server (Предварительная версия)**, а затем **откройте страницу соединителя**.

1. Следуйте инструкциям на вкладке **инструкции** в разделе **Конфигурация**.

    1. В **1. Конфигурация агента syslog для Linux** . Выполните этот шаг, если у вас еще нет запущенной службы пересылки журналов или если вам требуется другой сервер. Более подробные инструкции и пояснения см. в разделе [Шаг 1. Развертывание сервера пересылки журналов](connect-cef-agent.md) в документации по Sentinel Azure.

    1. В разделе **2. Пересылка журналов типов распространенных событий (CEF) в агент системного журнала** . Следуйте инструкциям сикотик, чтобы [настроить секретный сервер](https://thy.center/ss/link/syslog). Эта конфигурация должна включать следующие элементы:
        - Назначение журнала — имя узла и/или IP-адрес сервера пересылки журналов.
        - Протокол и порт — **TCP 514** (если в противном случае это не рекомендуется, обязательно выполните параллельное изменение в управляющей программе syslog на сервере пересылки журналов).
        - Формат журнала — CEF
        - Типы журналов — все доступные

    1. Ниже **3. Проверка подключения** . Проверка приема данных путем копирования команды на страницу соединителя и запуска ее на сервере пересылки журналов. Более подробные инструкции и пояснения см. в разделе [Шаг 3. Проверка подключения](connect-cef-verify.md) в документации Azure Sentinel.

        После того, как журналы начнут отображаться в Log Analytics, может пройти до 20 минут.

## <a name="find-your-data"></a>Поиск данных

После установки успешного подключения данные отображаются в **журналах** в разделе " **Sentinel** " в таблице *CommonSecurityLog* .

Чтобы запросить данные сервера Сикотик Secret в Log Analytics, скопируйте следующий код в окно запроса, применяя другие фильтры по своему выбору:

```kusto
CommonSecurityLog 
| where DeviceVendor == "Thycotic Software"
```

Некоторые полезные книги и примеры запросов см. на вкладке **дальнейшие действия** на странице соединителя.

## <a name="next-steps"></a>Дальнейшие действия

В этом документе вы узнали, как подключить Сикотик Secret Server к Azure Sentinel. Ознакомьтесь с дополнительными сведениями об Azure Sentinel в соответствующих статьях.

- Узнайте, как [отслеживать свои данные и потенциальные угрозы](quickstart-get-visibility.md).
- Узнайте, как приступить к [обнаружению угроз с помощью Azure Sentinel](tutorial-detect-threats-built-in.md).
- [Используйте книги](tutorial-monitor-your-data.md) для мониторинга данных.