---
title: Выявление дополнительных угроз с помощью анализа поведения пользователей и сущностей (УЕБА) в Azure Sentinel | Документация Майкрософт
description: Создание базовых показателей поведения для сущностей (пользователи, имена узлов, IP-адреса) и их использование для обнаружения аномального поведения и выявления неактивных постоянных устойчивых угроз (APT).
services: sentinel
documentationcenter: na
author: yelevin
manager: rkarlin
editor: ''
ms.service: azure-sentinel
ms.subservice: azure-sentinel
ms.devlang: na
ms.topic: conceptual
ms.tgt_pltfrm: na
ms.workload: na
ms.date: 01/25/2021
ms.author: yelevin
ms.openlocfilehash: 458c801e1434832bf65da669ca89cb5c5eebe2e8
ms.sourcegitcommit: 8245325f9170371e08bbc66da7a6c292bbbd94cc
ms.translationtype: MT
ms.contentlocale: ru-RU
ms.lasthandoff: 02/07/2021
ms.locfileid: "99807569"
---
# <a name="identify-advanced-threats-with-user-and-entity-behavior-analytics-ueba-in-azure-sentinel"></a>Выявление дополнительных угроз с помощью анализа поведения пользователей и сущностей (УЕБА) в Azure Sentinel

> [!IMPORTANT]
>
> - Функции УЕБА и Entity Pages теперь доступны в **общедоступной** части **_всех_** географических регионов и регионах Azure Sentinel.

## <a name="what-is-user-and-entity-behavior-analytics-ueba"></a>Что такое аналитика поведения пользователей и сущностей (УЕБА)?

### <a name="the-concept"></a>Концепция

Выявление угроз в Организации и их потенциальное влияние на то, что скомпрометированная сущность или вредоносная программа предварительной оценки всегда была трудоемкой и трудоемкой процессом. Продираться через оповещения, подключаясь к точкам и активному поиску, вы добавляете до огромного количества времени и усилий, затрачиваемых на минимальное число возвратов, а также возможность сложных угроз просто обходятного обнаружения. В частности, сомнительны угрозы, такие как нулевые, целевые и расширенные постоянные угрозы, могут быть наиболее опасными для вашей организации, что делает их обнаружение более важным.

Функция УЕБА в Azure Sentinel позволяет исключить затрачивать из рабочих нагрузок аналитиков и неуверенности в их усилиях, а также обеспечивает высокую точность и практическую логику, чтобы они могли сосредоточиться на исследовании и исправлении.

Так как Azure Sentinel собирает журналы и оповещения из всех подключенных источников данных, она анализирует их и создает базовые профили поведения сущностей Организации (например, пользователей, узлов, IP-адресов и приложений) в пределах времени и одноранговой группы. С помощью различных методов и возможностей машинного обучения Azure Sentinel может определить аномальные действия и помочь определить, скомпрометирован ли ресурс. Это не только то же самое, но и возможность выяснить относительную чувствительность определенных ресурсов, определить одноранговые группы ресурсов и оценить потенциальное воздействие какого-либо скомпрометированного ресурса (его "Sounds"). Используя эти сведения, можно эффективно определять приоритеты при исследовании и обработке инцидентов. 

### <a name="architecture-overview"></a>Обзор архитектуры

:::image type="content" source="media/identify-threats-with-entity-behavior-analytics/entity-behavior-analytics-architecture.png" alt-text="Архитектура аналитики поведения сущностей":::

### <a name="security-driven-analytics"></a>Аналитика на основе безопасности

С учетом парадигмы Gartner для решений УЕБА Azure Sentinel предоставляет подход "снаружи в использовании", основанный на трех кадрах:

- **Варианты использования:** Путем определения приоритетов для соответствующих направлений атак и сценариев, основанных на исследованиях в области безопасности, согласованных с MITRE АТРИ&CK, методиками и вспомогательными методами, которые размещают различные сущности как жертвы, перпетраторс или точки вращения в цепочке уничтожения; Метка Azure специализируется на наиболее ценных журналах, которые может предоставить каждый источник данных.

- **Источники данных:** Хотя в первую очередь и поддерживаются источники данных Azure, Azure Sentinel продуманно выбирает сторонние источники данных для предоставления данных, соответствующих нашим сценариям угроз.

- **Аналитика:** Используя различные алгоритмы машинного обучения (ML), Sentinel Azure определяет аномальные действия и четко отображает доказательства в виде контекстных дополнений, некоторые примеры которых приведены ниже.

    :::image type="content" source="media/identify-threats-with-entity-behavior-analytics/behavior-analytics-top-down.png" alt-text="Анализ поведения за пределами":::

В Azure Sentinel представлены артефакты, которые помогут аналитикам безопасности получить четкое представление о аномальных действиях в контексте и сравнить их с базовым профилем пользователя. Действия, выполняемые пользователем (или узлом или адресом), оцениваются контекстно, где результат "true" указывает на определенную аномалию:
- между географическими расположениями, устройствами и средами.
- за период времени и периодичность (по сравнению с собственным журналом пользователя).
- по сравнению с поведением одноранговых узлов.
- по сравнению с поведением Организации.

    :::image type="content" source="media/identify-threats-with-entity-behavior-analytics/context.png" alt-text="Контекст сущности":::


### <a name="scoring"></a>оценка.

Каждое действие оценивается как "Оценка приоритета расследования", которая определяет вероятность конкретного пользователя, выполняющего определенное действие, на основе изучения поведения пользователя и его коллег. Действия, идентифицируемые как наиболее нормальные, получают наивысший рейтинг (на шкале 0-10).

См. статью использование аналитики поведения в [Microsoft Cloud App Security](https://techcommunity.microsoft.com/t5/microsoft-security-and/prioritize-user-investigations-in-cloud-app-security/ba-p/700136) в качестве примера работы.

## <a name="entities-in-azure-sentinel"></a>Сущности в Azure Sentinel

### <a name="entity-identifiers"></a>Идентификаторы сущностей

Когда оповещения отправляются в метку Azure, они включают элементы данных, которые Azure Sentinel определяет и классифицирует как сущности, такие как учетные записи пользователей, узлы, IP-адреса и другие. В некоторых случаях такая идентификация может быть сложной задачей, если предупреждение не содержит достаточно сведений о сущности.

Например, учетные записи пользователей могут быть идентифицированы несколькими способами: с использованием числового идентификатора (GUID) учетной записи Azure AD или имени участника-пользователя (UPN) или с помощью сочетания имени пользователя и имени домена NT. Разные источники данных могут обозначать одного и того же пользователя разными способами. Таким образом, когда это возможно, Azure Sentinel объединяет эти идентификаторы в одну сущность, чтобы их можно было идентифицировать правильно.

Однако это может произойти, если один из поставщиков ресурсов создает предупреждение, в котором сущность недостаточна для идентификации, например имя пользователя без контекста доменного имени. В этом случае сущность пользователя не может быть объединена с другими экземплярами той же учетной записи пользователя, которая была идентифицирована как отдельная сущность, а эти две сущности останутся отдельными, а не едиными.

Чтобы свести к сведению риск возникновения такой ситуации, необходимо убедиться, что все поставщики предупреждений должны правильно определить сущности в создаваемых ими предупреждениях. Кроме того, синхронизация сущностей учетных записей пользователей с Azure Active Directory может создать унифицированный каталог, который будет иметь возможность объединять сущности учетных записей пользователей.

В Azure Sentinel в настоящее время определены следующие типы сущностей:

- Учетная запись пользователя (учетная запись)
- Узел
- IP-адрес (IP)
- Вредоносная программа
- Файл
- Процесс
- Облачное приложение (Клаудаппликатион)
- Доменное имя (DNS)
- Ресурс Azure
- Файл (FileHash)
- Раздел реестра
- Значение реестра
- Группа безопасности
- URL-адрес
- Устройство Интернета вещей
- Mailbox
- Почтовый кластер
- Почтовое сообщение
- Отправка почты

### <a name="entity-pages"></a>Страницы сущностей

Когда вы сталкиваетесь с любой сущностью (в настоящее время ограниченными пользователями и узлами) в поиске, предупреждении или расследовании, вы можете выбрать сущность и принять ее на **странице сущностей**— полную таблицу с полезной информацией об этой сущности. Типы сведений, которые можно найти на этой странице, включают основные факты о сущности, временную шкалу важных событий, связанных с этой сущностью, и сведения о поведении сущности.
 
Страницы сущностей состоят из трех частей:
- Левая панель содержит идентификационную информацию сущности, собранную из источников данных, таких как Azure Active Directory, Azure Monitor, центр безопасности Azure и защитник Майкрософт.

- Центральная панель отображает графическую и текстовую шкалу для важных событий, связанных с сущностью, таких как оповещения, закладки и действия. Действия — это статистические выражения важных событий от Log Analytics. Запросы, которые обнаруживают эти действия, разрабатываются группами исследований корпорации Майкрософт по безопасности.

- На правой панели представлена аналитика поведения сущности. Эти аналитические сведения помогают быстро выявить аномалии и угрозы безопасности. Аналитические данные разрабатываются группами исследований корпорации Майкрософт по безопасности и основаны на моделях обнаружения аномалий.

### <a name="the-timeline"></a>Временная шкала

:::image type="content" source="./media/identify-threats-with-entity-behavior-analytics/entity-pages-timeline.png" alt-text="Временная шкала страниц сущностей":::

Временная шкала является основной частью вклада страницы сущности в аналитику поведения в Azure Sentinel. Он представляет собой историю событий, связанных с сущностями, которые помогают понять действия сущности в течение определенного промежутка времени.

Можно выбрать **диапазон времени** из нескольких параметров (например, за *последние 24 часа*) или задать для него любой пользовательский интервал времени. Кроме того, можно задать фильтры, которые ограничивают данные на временной шкале конкретными типами событий или предупреждений.

На временную шкалу включены следующие типы элементов:

- Оповещения — все оповещения, в которых сущность определена как **сопоставленная сущность**. Обратите внимание, что если ваша организация создала [пользовательские оповещения с помощью правил аналитики](./tutorial-detect-threats-custom.md), следует убедиться, что сопоставление сущностей правил выполняется правильно.

- Закладки — все закладки, включающие конкретную сущность, показанную на странице.

- Действия — это статистическая обработка важных событий, связанных с сущностью. 
 
### <a name="entity-insights"></a>Entity Insights
 
Entity Insights — это запросы, определяемые исследователими безопасности Майкрософт, которые помогают аналитикам более эффективно исследовать и эффективнее. Аналитика представляется как часть страницы сущности и предоставляет ценные сведения о безопасности для узлов и пользователей в виде табличных данных и диаграмм. Наличие информации здесь означает, что вам не нужно Log Analytics. Аналитические сведения включают в себя данные о входах, добавлении групп, аномальных событиях и многом другим, а также включают сложные алгоритмы ML для обнаружения аномального поведения. Аналитика основана на следующих типах данных:
- Системный журнал
- SecurityEvent
- Журналы аудита
- Журналы входа
- Действие Office
- Бехавиораналитикс (УЕБА) 
 
### <a name="how-to-use-entity-pages"></a>Как использовать страницы сущностей

Страницы сущностей разрабатываются как часть нескольких сценариев использования, и к ним можно получить доступ из управления инцидентами, с помощью графа расследования, закладок или непосредственно со страницы **поиска сущностей в главном** меню Azure Sentinel.

:::image type="content" source="./media/identify-threats-with-entity-behavior-analytics/entity-pages-use-cases.png" alt-text="Варианты использования страниц сущностей":::


## <a name="data-schema"></a>Схема данных

### <a name="behavior-analytics-table"></a>Таблица аналитики поведения

| Поле                     | Описание                                                         |
|---------------------------|---------------------------------------------------------------------|
| TenantId                  | уникальный идентификатор клиента                                      |
| саурцерекордид            | уникальный идентификатор события ЕБА                                   |
| TimeGenerated             | Метка времени для вхождения действия                              |
| тимепроцессед             | Метка времени обработки действия ядром ЕБА            |
| ActivityType              | Категория высокого уровня действия                                 |
| Тип действия                | нормализованное имя действия                                     |
| UserName                  | имя пользователя, инициировавшего действие                    |
| UserPrincipalName         | полное имя пользователя, инициировавшего действие               |
| EventSource               | Источник данных, который предоставил исходное событие                        |
| саурцеипаддресс           | IP-адрес, с которого было инициировано действие                        |
| саурцеиплокатион          | страна, из которой было инициировано действие, дополненное с IP-адреса |
| саурцедевице              | имя узла устройства, инициировавшего действие                  |
| дестинатионипаддресс      | IP-адрес целевого объекта действия                            |
| дестинатиониплокатион     | страна целевого объекта действия, дополненного IP-адресом     |
| дестинатиондевице         | имя целевого устройства                                           |
| **усерсинсигхтс**         | Контекстные обогащения вовлеченных пользователей                            |
| **девицесинсигхтс**       | контекстуальное дополнение вовлеченных устройств                          |
| **активитинсигхтс**      | контекстный анализ действий на основе нашего профилирования              |
| **инвестигатионприорити** | Оценка аномалий, от 0-10 (0 = мягкое, 10 = сильно аномальное)         |
|

Полный набор контекстных дополнений, указанных в **усерсинсигхтс**, **девицесинсигхтс** и **активитинсигхтс** , см. в [справочном документе уеба](ueba-enrichments.md).

### <a name="querying-behavior-analytics-data"></a>Запрос данных аналитики поведения

С помощью [ККЛ](/azure/data-explorer/kusto/query/)можно запрашивать таблицу аналитики поведения.

Например, если нам нужно найти все варианты пользователя, который не смог войти в ресурс Azure, где он впервые попытался подключиться из определенной страны, а подключения из этой страны нередко применяются к одноранговым узлам пользователя, можно использовать следующий запрос:

```Kusto
BehaviorAnalytics
| where ActivityType == "FailedLogOn"
| where FirstTimeUserConnectedFromCountry == True
| where CountryUncommonlyConnectedFromAmongPeers == True
```

### <a name="user-peers-metadata---table-and-notebook"></a>Метаданные пиринга пользователя — таблица и Записная книжка

Метаданные одноранговых узлов предоставляют важный контекст при обнаружении угроз, в исследовании инцидента и поиске потенциальных угроз. Аналитики безопасности могут наблюдать за нормальными действиями одноранговых пользователей, чтобы определить, являются ли действия пользователя нетипичными по сравнению с его коллегами.

Azure Sentinel вычисляет и ранжирует одноранговые узлы пользователей на основе членства пользователя в группе безопасности Azure AD, списка рассылки, обновляло и сохраняет ранги, Ранжированные по 1-20, в таблице **усерпираналитикс** . На следующем снимке экрана показана схема таблицы Усерпираналитикс и отображаются первые 8-Ранжированные одноранговые узлы пользователя Кендалл Коллинз. Для нормализации коэффициентами взвешивания для вычисления ранга Azure Sentinel используется алгоритм *Term-инверсия документов* (TF-IDF). чем меньше группа, тем выше плотность. 

:::image type="content" source="./media/identify-threats-with-entity-behavior-analytics/user-peers-metadata.png" alt-text="Снимок экрана таблицы метаданных для одноранговых узлов пользователей":::

Вы можете использовать [записную книжку Jupyter](https://github.com/Azure/Azure-Sentinel-Notebooks/tree/master/BehaviorAnalytics/UserSecurityMetadata) , предоставленную в репозитории Azure Sentinel GitHub, для визуализации метаданных одноранговых узлов пользователей. Подробные инструкции по использованию записной книжки см. в разделе " [Интерактивный анализ и](https://github.com/Azure/Azure-Sentinel-Notebooks/blob/master/BehaviorAnalytics/UserSecurityMetadata/Guided%20Analysis%20-%20User%20Security%20Metadata.ipynb) Записная книжка метаданных безопасности пользователя".

### <a name="permission-analytics---table-and-notebook"></a>Аналитика разрешений — таблица и Записная книжка

Аналитика разрешений помогает определить потенциальное влияние взлома ресурса организации злоумышленником. Это воздействие также называется «радиусом» для ресурса «всплеск». Аналитики безопасности могут использовать эти сведения для определения приоритетов обработки происшествий и инцидентов.

Метка Azure определяет прямые и транзитивные права доступа, удерживаемые определенным пользователем, в ресурсы Azure, оценивая подписки Azure, к которым пользователь имеет доступ напрямую или через группы или субъекты-службы. Эти сведения, а также полный список членства пользователя в группе безопасности Azure AD хранятся в таблице **усеракцессаналитикс** . На снимке экрана ниже показан пример строки в таблице Усеракцессаналитикс для пользователя Алекс Джонсон. **Исходная сущность** — это учетная запись пользователя или субъекта-службы, а **Целевая сущность** — это ресурс, к которому имеет доступ исходная сущность. Значения **уровня доступа** и **типа доступа** зависят от модели управления доступом целевой сущности. Вы видите, что Алекс имеет доступ для участников в подписке Azure для *клиента гостиниц Contoso*. Модель управления доступом подписки — это Azure RBAC.   

:::image type="content" source="./media/identify-threats-with-entity-behavior-analytics/user-access-analytics.png" alt-text="Снимок экрана таблицы аналитики доступа пользователей":::

Для визуализации данных аналитики разрешений можно использовать [записную книжку Jupyter](https://github.com/Azure/Azure-Sentinel-Notebooks/tree/master/BehaviorAnalytics/UserSecurityMetadata) (ту же самую записную книжку, которую упоминали ранее) из репозитория Azure Sentinel в репозитории GitHub. Подробные инструкции по использованию записной книжки см. в разделе " [Интерактивный анализ и](https://github.com/Azure/Azure-Sentinel-Notebooks/blob/master/BehaviorAnalytics/UserSecurityMetadata/Guided%20Analysis%20-%20User%20Security%20Metadata.ipynb) Записная книжка метаданных безопасности пользователя".

### <a name="hunting-queries-and-exploration-queries"></a>Поиск запросов и исследование запросов

Azure Sentinel предоставляет готовый набор запросов на поиск, исследование запросов и книгу на основе таблицы Бехавиораналитикс. Эти средства представляют обогащенные данные, нацеленные на конкретные варианты использования, которые указывают на аномальное поведение. 

Узнайте больше о [поиске и диаграмме расследования](./hunting.md) в Azure Sentinel.

## <a name="next-steps"></a>Дальнейшие действия
В этом документе вы узнали о возможностях аналитики поведения сущностей Azure Sentinel. Практические рекомендации по реализации и использованию ценных сведений, которые вы получили, см. в следующих статьях:

- [Включите аналитику поведения сущностей](./enable-entity-behavior-analytics.md) в Azure Sentinel.
- [Поиск угроз безопасности](./hunting.md).