---
title: Импорт аналитики угроз в Azure Sentinel | Документация Майкрософт
description: Используйте каналы анализа угроз в Azure Sentinel для анализа данных, обнаружения угроз и создания предупреждений и инцидентов. Визуализируйте данные аналитики угроз с помощью книг.
services: sentinel
documentationcenter: na
author: yelevin
manager: rkarlin
editor: ''
ms.service: azure-sentinel
ms.subservice: azure-sentinel
ms.devlang: na
ms.topic: conceptual
ms.tgt_pltfrm: na
ms.workload: na
ms.date: 08/26/2020
ms.author: yelevin
ms.openlocfilehash: e04d7fa1f319ca3969d8acdc0235e2838bb3a88d
ms.sourcegitcommit: 829d951d5c90442a38012daaf77e86046018e5b9
ms.translationtype: MT
ms.contentlocale: ru-RU
ms.lasthandoff: 10/09/2020
ms.locfileid: "90997607"
---
# <a name="import-threat-intelligence-into-azure-sentinel"></a>Импорт аналитики угроз в Azure Sentinel

## <a name="introduction-to-threat-intelligence"></a>Общие сведения об аналитике угроз

Кибератакная аналитика угроз (CTI) — это сведения о известных существующих или потенциальных угрозах для систем и пользователей. Этот тип информации занимает много форм, от письменных отчетов, содержащих сведения о мотивациях, инфраструктуре и методиках конкретного субъекта угроз, до определенных наблюдений за IP-адресами, доменами и хэшами файлов, связанными с угрозами кибератак. CTI используется организациями для предоставления важного контекста необычному мероприятию, чтобы персонал безопасности мог быстро предпринять меры для защиты своих сотрудников и активов. CTI может быть источником из многих мест, таких как каналы данных с открытым исходным кодом, сообщества анализа угроз, совместный доступ к бизнес-аналитике, каналы коммерческих интеллектов и локальные аналитики, собранные в рамках расследования по безопасности в Организации.

В решении о безопасности и управлении событиями (SIEM), например в Azure Sentinel, наиболее используемая форма CTI — это индикаторы угроз, часто называемые индикаторами компрометации или Иокс. Индикаторы угроз — это данные, связывающие наблюдения, такие как URL-адреса, хэши файлов или IP-адреса, с известными действиями угроз, такими как фишинг, ботнетов или вредоносная программа. Эта форма логики угроз часто называется тактических, так как она может быть применена к продуктам безопасности и автоматизации в крупном масштабе для защиты и обнаружения потенциальных угроз для Организации. В Azure Sentinel можно использовать индикаторы угроз, чтобы обнаружить вредоносные действия в вашей среде и предоставить контекст для анализа безопасности, чтобы помочь в информировании решений об ответах.

Аналитику угроз (TI) можно интегрировать в Azure Sentinel с помощью следующих действий:

- Используйте **соединители данных** для различных платформ Ti, чтобы [импортировать логику операций с угрозами](./connect-threat-intelligence.md) в Azure Sentinel.
- Просматривайте импортированную аналитику угроз и управляйте ею в **журналах** и в новой области **логики операций с угрозами** Azure Sentinel.
- Используйте встроенные шаблоны правил **аналитики** для создания оповещений системы безопасности и инцидентов с помощью импортированной аналитики угроз.
- Визуализируйте ключевые сведения об аналитике угроз в Azure Sentinel с помощью **книги аналитики угроз**.

Аналитика угроз также предоставляет полезный контекст в других возможностях Azure Sentinel, **таких как поиск** и **записные книжки**, и, как и в этой статье, эти возможности рассматриваются в [этой отличной записи блога с помощью Ян Хеллен на записных книжках Jupyter в Sentinel](https://techcommunity.microsoft.com/t5/azure-sentinel/using-threat-intelligence-in-your-jupyter-notebooks/ba-p/860239), что охватывает использование CTI в записных книжках.

## <a name="azure-sentinel-data-connectors-for-threat-intelligence"></a>Соединители данных Azure Sentinel для аналитики угроз

Как и в случае с другими данными о событиях в Azure Sentinel, индикаторы угроз импортируются с помощью соединителей данных. Существуют два соединителя данных в Azure Sentinel, специально предназначенные для индикаторов угроз, **таксии** и **платформ аналитики**угроз. В зависимости от того, где находятся индикаторы угроз для Организации, можно использовать только один соединитель данных или оба соединители. Давайте поговорим о каждом из соединителей данных.

### <a name="adding-threat-indicators-to-azure-sentinel-with-the-threat-intelligence-platforms-data-connector"></a>Добавление индикаторов угроз в Azure Sentinel с помощью соединителя данных платформ аналитики угроз

Многие организации используют решения платформы бизнес-аналитики (TIP) для агрегирования каналов индикаторов угроз из различных источников, для обнаружения данных на платформе, а затем для выбора индикаторов угроз, применяемых к различным решениям безопасности, таким как сетевые устройства, решения для расширенной защиты от угроз или решения Siem, такие как Sentinel Azure. Если ваша организация использует интегрированное решение TIP, например МИСП, аномали Среатстреам, Среатконнект или Palo Alto Networks Минемелд, то **соединитель данных платформы аналитики угроз** позволяет использовать Совет по импорту индикаторов угроз в Azure Sentinel. Так как соединитель работает с [api Microsoft Graph Security тииндикаторс](https://docs.microsoft.com/graph/api/resources/tiindicator) , он также может использоваться любой пользовательской платформой аналитики угроз, чтобы воспользоваться преимуществами API тииндикаторс для отправки индикаторов в Azure Sentinel (и другим решениям безопасности Майкрософт, например, ATP в защитнике).

:::image type="content" source="media/import-threat-intelligence/threat-intel-import-path.png" alt-text="Путь импорта аналитики угроз":::

Выполните следующие действия, чтобы импортировать индикаторы угроз в Azure Sentinel из интегрированной подсказок или пользовательского решения для анализа угроз.

1. Получение идентификатора приложения и секрета клиента из Azure Active Directory

1. Введите эту информацию в решение TIP или в пользовательское приложение

1. Включение соединителя данных платформ аналитики угроз в Azure Sentinel

Ниже приведен подробный обзор каждого из этих шагов.

#### <a name="obtain-an-application-id-and-client-secret-from-your-azure-active-directory"></a>Получение идентификатора приложения и секрета клиента из Azure Active Directory

Независимо от того, работаете ли вы с TIP или с пользовательским решением, для подключения и отправки индикаторов угроз API-интерфейсу Тииндикаторс требуются некоторые основные сведения. Необходимо получить три следующих фрагмента информации:
- Идентификатор приложения (клиента)
- Идентификатор каталога (клиента)
- Секрет клиента

Эти сведения всегда берутся из Azure Active Directory с помощью процесса **регистрации приложения** , который включает в себя следующие три шага:
- Регистрация приложения в Azure Active Directory
- Укажите разрешения, необходимые приложению для подключения к Microsoft Graph API Тииндикаторс и отправки индикаторов угроз
- Получите согласие от Организации, чтобы предоставить эти разрешения для этого приложения.  

**Регистрация приложения с помощью Azure Active Directory**

1. Откройте [портал Azure](https://portal.azure.com/) и перейдите к службе **Azure Active Directory** .

1. Выберите **Регистрация приложений** в меню и щелкните **создать регистрацию**.

1. Выберите имя для регистрации приложения, выберите переключатель **один клиент** и нажмите кнопку **зарегистрировать**.

    :::image type="content" source="media/import-threat-intelligence/threat-intel-register-application.png" alt-text="Путь импорта аналитики угроз":::

1. На полученном экране Скопируйте значения **идентификатора приложения (клиента)** и **идентификатора каталога (клиента)** . Это первые два фрагмента информации, которые потребуются позже, чтобы настроить Совет или пользовательское решение для отправки индикаторов угроз в Azure Sentinel.

**Укажите разрешения, необходимые для приложения**

1. Откройте [портал Azure](https://portal.azure.com/) и перейдите к службе **Azure Active Directory** .

1. Выберите **Регистрация приложений** в меню и выберите ваше новое зарегистрированное приложение.

1. Выберите **разрешения API** в меню и нажмите кнопку **Добавить разрешение** .

1. На странице **Выбор API** выберите **Microsoft Graph** , чтобы выбрать из списка разрешений Microsoft Graph.

1. При запросе **того, какой тип разрешений требуется приложению?** выберите **разрешения приложения**. Это тип разрешений, используемых приложениями, которые проходят проверку подлинности с помощью идентификатора приложения и секретов приложения (ключи API).

1. Выберите **среатиндикаторс. ReadWrite. овнедби** и щелкните **Добавить разрешения** , чтобы добавить это разрешение в список разрешений вашего приложения.

    :::image type="content" source="media/import-threat-intelligence/threat-intel-api-permissions-1.png" alt-text="Путь импорта аналитики угроз":::

**Получите согласие от Организации, чтобы предоставить эти разрешения.**

1. Чтобы предоставить согласие, вам потребуется Azure Active Directory глобальный администратор, чтобы выбрать разрешение **согласия администратора для вашего клиента** на странице разрешения API приложения. Если у вас нет роли глобального администратора в вашей учетной записи, эта кнопка будет недоступна, и вам потребуется попросить глобального администратора вашей организации выполнить этот шаг.

    :::image type="content" source="media/import-threat-intelligence/threat-intel-api-permissions-2.png" alt-text="Путь импорта аналитики угроз":::

1. После предоставления согласия для приложения вы увидите зеленый флажок в разделе **состояние**.
 
Теперь, когда приложение зарегистрировано и предоставлены разрешения, вы можете получить Последнее дело в списке — секрет клиента для вашего приложения.

1. Откройте [портал Azure](https://portal.azure.com/) и перейдите к службе **Azure Active Directory** .

1. Выберите **Регистрация приложений** в меню и выберите ваше новое зарегистрированное приложение.

1. Выберите **сертификаты & секреты** в меню и нажмите кнопку **создать секрет клиента** , чтобы получить секрет (ключ API) для вашего приложения.

    :::image type="content" source="media/import-threat-intelligence/threat-intel-client-secret.png" alt-text="Путь импорта аналитики угроз":::

1. Нажмите кнопку **Добавить** и **обязательно скопируйте секрет клиента**, так как вы не сможете получить этот секрет еще раз, если вы уходите с этой страницы. Это значение потребуется при настройке Совета или пользовательского решения.

#### <a name="input-this-information-into-your-tip-solution-or-custom-application"></a>Введите эту информацию в решение TIP или в пользовательское приложение

Теперь у вас есть все три части информации, необходимые для настройки TIP или пользовательского решения для отправки индикаторов угроз в Azure Sentinel. 
- Идентификатор приложения (клиента)
- Идентификатор каталога (клиента)
- Секрет клиента

Укажите эти значения в конфигурации интегрированного Совета или пользовательского решения, где это необходимо, а индикаторы угроз будут отправляться через Microsoft Graph API Тииндикаторс, нацеленный на метку Azure.

#### <a name="enable-the-threat-intelligence-platforms-data-connector-in-azure-sentinel"></a>Включение соединителя данных платформ аналитики угроз в Azure Sentinel

Последним шагом в процессе интеграции является включение соединителя данных **платформ аналитики угроз** в Azure Sentinel. Это действие, которое импортирует индикаторы угроз, отправленные из вашего Совета, или пользовательского решения с помощью Microsoft Graph API Тииндикаторс в Azure Sentinel. Эти индикаторы будут доступны для всех рабочих областей Azure Sentinel в вашей организации. Выполните следующие действия, чтобы включить соединитель данных платформы аналитики угроз для каждой рабочей области:

1. Откройте [портал Azure](https://portal.azure.com/) и перейдите к службе **Sentinel Azure** .

1. Выберите **рабочую область** , в которую необходимо импортировать индикаторы угроз, отправленные из вашего Совета или пользовательского решения.

1. В меню выберите **соединители данных** , выберите **платформы для анализа угроз** в коллекции соединителей и нажмите кнопку **открыть страницу соединителя** .

1. Так как вы уже завершили регистрацию приложения и настроили Совет или пользовательское решение для отправки индикаторов угроз, единственным шагом является нажатие кнопки **подключить** .

В течение нескольких минут индикаторы угроз должны начинаться в этой рабочей области Azure Sentinel.

### <a name="adding-threat-indicators-to-azure-sentinel-with-the-threat-intelligence---taxii-data-connector"></a>Добавление индикаторов угроз в Azure Sentinel с помощью соединителя данных для аналитики угроз — ТАКСИИ Data Connector

Наиболее широко распространенный промышленный стандарт передачи аналитики угроз — это [сочетание формата данных Стикс и протокола таксии](https://oasis-open.github.io/cti-documentation/). Если ваша организация получает индикаторы угроз из решений, которые поддерживают текущую версию СТИКС/ТАКСИИ (2,0 или 2,1), можно использовать соединитель данных **аналитики угроз — таксии** , чтобы перенести индикаторы угроз в Azure Sentinel. Соединитель данных "аналитика угроз — ТАКСИИ" включает встроенный клиент ТАКСИИ в Azure Sentinel для импорта аналитики угроз с серверов ТАКСИИ 2. x.

:::image type="content" source="media/import-threat-intelligence/threat-intel-taxii-import-path.png" alt-text="Путь импорта аналитики угроз":::
 
Выполните следующие действия, чтобы импортировать СТИКС отформатированные индикаторы угроз в Azure Sentinel с сервера ТАКСИИ:

1. Получение корня API сервера ТАКСИИ и идентификатора коллекции

1. Включение соединителя данных для аналитики угроз — ТАКСИИ Data Connector в Azure Sentinel

Теперь давайте подробно рассмотрим каждый из этих шагов.

#### <a name="obtain-the-taxii-server-api-root-and-collection-id"></a>Получение корня API сервера ТАКСИИ и идентификатора коллекции

Серверы ТАКСИИ 2. x объявляют корни API, то есть URL-адреса, на которых размещаются коллекции аналитики угроз. Чаще всего корень API можно получить на странице документации поставщика аналитики угроз, в котором размещается сервер ТАКСИИ. Однако иногда единственной объявленной информацией является URL-адрес, известный как конечная точка обнаружения. В этом случае корень API легко найти с помощью конечной точки обнаружения. Если вы уже знакомы с корневым каталогом API сервера ТАКСИИ и идентификаторами коллекций, с которыми вы хотите работать, перейдите к следующему разделу, **включите соединитель Data Intelligence-таксии в Azure Sentinel**.

Рассмотрим реальный пример того, как использовать простую программу командной строки [с именем «](https://en.wikipedia.org/wiki/CURL)текст», которая предоставляется в Windows и большинстве дистрибутивов Linux для обнаружения корня API и просмотра коллекций сервера таксии, начиная с конечной точки обнаружения. В этом примере мы будем использовать конечную точку обнаружения сервера [аномали Лимо](https://www.anomali.com/community/limo) среатстреам таксии 2,0.

1.  В браузере перейдите к [конечной точке обнаружения СРЕАТСТРЕАМ таксии 2,0 Server](https://limo.anomali.com/taxii) , чтобы получить корень API. Аутентификация с помощью пользователя и пароля `guest` .

    ```json
    {
        "api_roots":
        [
            "https://limo.anomali.com/api/v1/taxii2/feeds/",
            "https://limo.anomali.com/api/v1/taxii2/trusted_circles/",
            "https://limo.anomali.com/api/v1/taxii2/search_filters/"
        ],
        "contact": "info@anomali.com",
        "default": "https://limo.anomali.com/api/v1/taxii2/feeds/",
        "description": "TAXII 2.0 Server (guest)",
        "title": "ThreatStream Taxii 2.0 Server"
    }
    ```

2.  Используйте служебную программу и корень API ( https://limo.anomali.com/api/v1/taxii2/feeds/) из предыдущего шага, чтобы просмотреть список идентификаторов коллекций, размещенных в корне API.

    ```json
    curl -u guest https://limo.anomali.com/api/v1/taxii2/feeds/collections/
    {
        "collections":
        [
            {
                "can_read": true,
                "can_write": false,
                "description": "",
                "id": "107",
                "title": "Phish Tank"
            },
            {
                "can_read": true,
                "can_write": false,
                "description": "",
                "id": "135",
                "title": "Abuse.ch Ransomware IPs"
            },
            {
                "can_read": true,
                "can_write": false,
                "description": "",
                "id": "136",
                "title": "Abuse.ch Ransomware Domains"
            },
            {
                "can_read": true,
                "can_write": false,
                "description": "",
                "id": "150",
                "title": "DShield Scanning IPs"
            },
            {
                "can_read": true,
                "can_write": false,
                "description": "",
                "id": "200",
                "title": "Malware Domain List - Hotlist"
            },
            {
                "can_read": true,
                "can_write": false,
                "description": "",
                "id": "209",
                "title": "Blutmagie TOR Nodes"
            },
            {
                "can_read": true,
                "can_write": false,
                "description": "",
                "id": "31",
                "title": "Emerging Threats C&C Server"
            },
            {
                "can_read": true,
                "can_write": false,
                "description": "",
                "id": "33",
                "title": "Lehigh Malwaredomains"
            },
            {
                "can_read": true,
                "can_write": false,
                "description": "",
                "id": "41",
                "title": "CyberCrime"
            },
            {
                "can_read": true,
                "can_write": false,
                "description": "",
                "id": "68",
                "title": "Emerging Threats - Compromised"
            }
        ]
    }
    ```

Теперь у вас есть вся информация, необходимая для подключения Sentinel Azure к одной или нескольким коллекциям серверов ТАКСИИ, предоставляемым аномали Лимо.

| **Корень API** (https://limo.anomali.com/api/v1/taxii2/feeds/) | Идентификатор коллекции |
| ------------------------------------------------------------ | ------------: |
| **Phishing-цистерна**                                               | 107           |
| **Abuse.chные IP-адреса для атаки**                                  | 135           |
| **Домены Abuse.ch для атаки**                              | 136           |
| **Дшиелд проверки IP-адресов**                                     | 150           |
| **Список доменов вредоносных программ — Хотлист**                            | 200           |
| **Узлы блутмагие TOR**                                      | 209           |
| **Новые угрозы на сервере c&C**                              |  31           |
| **Лехигх Малваредомаинс**                                    |  33           |
| **CyberCrime**                                               |  41           |
| **Новые угрозы — скомпрометированные**                           |  68           |
|

#### <a name="enable-the-threat-intelligence---taxii-data-connector-in-azure-sentinel"></a>Включение соединителя данных для аналитики угроз — ТАКСИИ Data Connector в Azure Sentinel

Чтобы импортировать индикаторы угроз в Azure Sentinel с сервера ТАКСИИ, выполните следующие действия.

1. Откройте [портал Azure](https://portal.azure.com/) и перейдите к службе **Sentinel Azure** .

1. Выберите **рабочую область** , для которой необходимо импортировать индикаторы угроз с сервера таксии.

1. В меню выберите **соединители данных** , выберите Анализ **угроз — таксии** из коллекции соединителей и нажмите кнопку **открыть страницу соединителя** .

1. Введите **имя** для этой коллекции серверов Таксии, **корневой URL-адрес API**, **идентификатор коллекции**, **имя пользователя** (если требуется) и **пароль** (если требуется) и нажмите кнопку " **Добавить** ".

    :::image type="content" source="media/import-threat-intelligence/threat-intel-configure-taxii-servers.png" alt-text="Путь импорта аналитики угроз":::
 
Должно появиться сообщение о том, что подключение к серверу ТАКСИИ успешно установлено, и вы можете повторить шаг (4) выше столько раз, сколько нужно для подключения к нескольким коллекциям с одного или разных серверов ТАКСИИ.

## <a name="view-your-threat-indicators-in-azure-sentinel"></a>Просмотр индикаторов угроз в Azure Sentinel

Теперь, когда вы успешно импортировали индикаторы угроз в метку Azure с помощью **платформ аналитики угроз** и (или) соединителя данных для анализа угроз **— таксии** , их можно просмотреть в таблице **среатинтеллиженцеиндикатор** в **журналах** , где хранятся все данные события Sentinel Azure. Эта таблица является основанием для запросов, выполняемых другими компонентами Azure Sentinel, такими как аналитика и книги. Вот как можно найти и просмотреть индикаторы угроз в таблице **среатинтеллиженцеиндикатор** .

1. Откройте [портал Azure](https://portal.azure.com/) и перейдите к службе **Sentinel Azure** .

1. Выберите **рабочую область** , в которую вы импортировали индикаторы угроз с помощью соединителя данных аналитики угроз.

1. Выберите **журналы** в разделе **Общие** в меню "Sentinel" Azure.

1. Таблица **среатинтеллиженцеиндикатор** находится в группе **маркеров Azure** .

1. Выберите значок **предварительного просмотра данных** (глаз) рядом с именем таблицы и нажмите кнопку " **Показать в редакторе запросов** ", чтобы выполнить запрос, который будет отображать записи из этой таблицы.

Результаты должны выглядеть аналогично показанному ниже индикатору угрозы:

:::image type="content" source="media/import-threat-intelligence/threat-intel-sample-query.png" alt-text="Путь импорта аналитики угроз":::
 
## <a name="manage-your-threat-indicators-in-the-new-threat-intelligence-area-of-azure-sentinel"></a>Управление индикаторами угроз в новой области анализа угроз Azure Sentinel

С помощью новой области " **аналитика угроз** ", доступной в меню "Sentinel" Azure, можно также просматривать, сортировать, фильтровать и искать импортированные индикаторы угроз без написания запроса **журналов** . Эта новая область также позволяет создавать индикаторы угроз непосредственно в интерфейсе Sentinel Azure, а также выполнять общие административные задачи аналитики угроз, такие как добавление тегов индикаторов и создание новых индикаторов, относящихся к исследованию безопасности.
Рассмотрим две наиболее распространенные задачи: создание новых индикаторов угроз и индикаторов тегов для простоты группирования и ссылки.

1. Откройте [портал Azure](https://portal.azure.com/) и перейдите к службе **Sentinel Azure** .

1. Выберите **рабочую область** , в которую вы импортировали индикаторы угроз с помощью соединителя данных аналитики угроз.

1. Выберите **аналитика угроз** в разделе "Управление угрозами" в меню "Sentinel" Azure.

1. Нажмите кнопку **Добавить новую** в верхнем меню страницы.

    :::image type="content" source="media/import-threat-intelligence/threat-intel-add-new-indicator.png" alt-text="Путь импорта аналитики угроз" lightbox="media/import-threat-intelligence/threat-intel-add-new-indicator.png":::

1. Выберите тип индикатора, а затем заполните обязательные поля, отмеченные красной звездочкой (*) на **новой панели индикаторов** .

1. Нажмите кнопку **Применить**. Индикатор добавляется в сетку индикаторы, а также отправляется в таблицу Среатинтеллиженцеиндикатор в **журналах**.

Теги угроз — это простой способ сгруппировать их, чтобы упростить их поиск. Как правило, вы можете применить тег к индикаторам, связанным с конкретным инцидентом, или к индикаторам, представляющим угрозы от определенного известного субъекта или хорошо известной кампании по атакам. Вы можете пометить индикаторы угроз по отдельности или выбрать несколько индикаторов и пометить их как раз. Ниже приведен пример добавления тегов к нескольким индикаторам с ИДЕНТИФИКАТОРом инцидента. Поскольку маркировка является свободной формой, рекомендуется создать стандартные соглашения об именовании для тегов индикаторов угроз. К каждому индикатору можно применить несколько тегов.

:::image type="content" source="media/import-threat-intelligence/threat-intel-tagging-indicators.png" alt-text="Путь импорта аналитики угроз" lightbox="media/import-threat-intelligence/threat-intel-tagging-indicators.png":::

## <a name="analytics-puts-your-threat-indicators-to-work-detecting-potential-threats"></a>Аналитика позволяет индикаторам угроз работать над обнаружением потенциальных угроз

Вы получаете индикаторы угроз в Azure Sentinel; Вы узнали, как просматривать их и управлять ими; Теперь посмотрим, что они могут сделать. Наиболее важный вариант использования индикаторов угроз в решениях SIEM, таких как Azure Sentinel, — правила Power Analytics.  Эти правила на основе индикаторов сравнивают необработанные события из источников данных с индикаторами угроз для обнаружения угроз безопасности в Организации. В Azure Sentinel **Analytics**создаются правила аналитики, которые выполняются по расписанию и создают оповещения системы безопасности. Правила определяются запросами, а также конфигурациями, которые определяют, как часто должно выполняться правило, какие типы результатов запроса должны создавать оповещения системы безопасности и какие автоматические ответы будут срабатывать при создании предупреждений.

Хотя вы всегда можете создавать новые правила аналитики с нуля, Azure Sentinel предоставляет набор встроенных шаблонов правил, созданных специалистами по безопасности Майкрософт, которые можно использовать "как есть" или изменить в соответствии с вашими потребностями. Можно легко найти шаблоны правил, которые используют индикаторы угроз, так как все они начинаются с «**Map Ti**...». Все эти шаблоны правил работают аналогично, и единственным отличием является использование типов индикаторов угроз (домен, электронная почта, хэш файла, IP-адрес или URL-адрес) и тип события для сопоставления. В каждом шаблоне перечислены необходимые источники данных, необходимые для работы правила, поэтому можно быстро увидеть, есть ли необходимые события, уже импортированные в Azure Sentinel.

Давайте рассмотрим один из этих шаблонов правил и пошаговое руководство по включению и настройке правил для создания оповещений безопасности с помощью индикаторов угроз, импортированных в Azure Sentinel. В этом примере мы будем использовать шаблон правила, именуемый **сущностью IP-адреса схемы Ti, в AzureActivity**. Это правило будет соответствовать любому индикатору угрозы типа IP-адреса со всеми событиями действий Azure. При обнаружении соответствия будет создано **предупреждение** , а также соответствующий **инцидент** для исследования группой управления операциями безопасности. Это правило аналитики будет выполняться успешно, только если вы включили один или оба соединителя данных **аналитики угроз** (для импорта индикаторов угроз) и соединитель данных **действий Azure** (для импорта событий уровня подписки Azure).

1. Откройте [портал Azure](https://portal.azure.com/) и перейдите к службе **Sentinel Azure** .

1. Выберите **рабочую область** , в которую вы импортировали индикаторы угроз с помощью соединителей данных **аналитики угроз** и данных о действиях Azure с помощью соединителя данных **действий Azure** .

1. Выберите **аналитика** в разделе " **Конфигурация** " в меню "Sentinel" Azure.

1. Перейдите на вкладку **шаблоны правил** , чтобы просмотреть список доступных шаблонов правил аналитики.

1. Перейдите к правилу, озаглавленному " **IP-сущность с именем Ti", в AzureActivity** и убедитесь, что вы подключили все необходимые источники данных, как показано ниже.

    :::image type="content" source="media/import-threat-intelligence/threat-intel-required-data-sources.png" alt-text="Путь импорта аналитики угроз":::

1. Выберите это правило и нажмите кнопку **создать правило** . Откроется мастер для настройки правила. Заполните параметры здесь и нажмите кнопку **Далее: Настройка логики правила >** .

    :::image type="content" source="media/import-threat-intelligence/threat-intel-create-analytics-rule.png" alt-text="Путь импорта аналитики угроз" Azure. Инциденты — это то, что специалисты по операциям безопасности будут рассматривать и исследовать, чтобы определить соответствующие действия ответа. Подробные сведения можно найти в этом [учебнике: исследование инцидентов с помощью Sentinel](./tutorial-investigate-cases.md).

## <a name="workbooks-provide-insights-about-your-threat-intelligence"></a>Книги предоставляют подробные сведения о аналитике угроз

Наконец, вы можете использовать книгу-Sentinel Azure, чтобы визуализировать ключевые сведения об аналитике угроз в Azure Sentinel, а также легко настраивать книги в соответствии с потребностями бизнеса.
Давайте покажем, как найти книгу аналитики угроз, предоставленную в Azure Sentinel, а также как вносить изменения в книгу для ее настройки.

1. Откройте [портал Azure](https://portal.azure.com/) и перейдите к службе **Sentinel Azure** .

1. Выберите **рабочую область** , в которую вы импортировали индикаторы угроз с помощью соединителя данных аналитики угроз.

1. Выберите **книги** из раздела **Управление угрозами** в меню "Sentinel" Azure.

1. Перейдите к книге " **аналитика угроз** " и убедитесь в наличии данных в таблице **среатинтеллиженцеиндикатор** , как показано ниже.

    :::image type="content" source="media/import-threat-intelligence/threat-intel-verify-data.png" alt-text="Путь импорта аналитики угроз":::
 
1. Нажмите кнопку **сохранить** и выберите расположение Azure для хранения книги. Этот шаг является обязательным, если вы собираетесь изменить книгу каким-либо образом и сохраняете изменения.

1. Теперь нажмите кнопку **Просмотр сохраненной книги** , чтобы открыть книгу для просмотра и редактирования.

1. Теперь вы увидите диаграммы по умолчанию, предоставляемые шаблоном. Теперь выполним некоторые изменения в одной из диаграмм. Нажмите кнопку **изменить** в верхней части страницы, чтобы перейти в режим правки для книги.

1. Давайте добавим новую диаграмму индикаторов угроз по типам угроз. Прокрутите страницу вниз и выберите Добавить запрос.

1. Добавьте следующий текст в текстовое поле **log Analytics запроса журнала рабочей области** :
    ```kusto
    ThreatIntelligenceIndicator
    | summarize count() by ThreatType
    ```

1. В раскрывающемся списке **визуализация** выберите **линейчатая диаграмма**.

1. Нажмите кнопку **done Edit (готово к редактированию** ). Вы создали новую диаграмму для книги.

    :::image type="content" source="media/import-threat-intelligence/threat-intel-bar-chart.png" alt-text="Путь импорта аналитики угроз":::

Книги предоставляют мощные интерактивные панели мониторинга, которые позволяют получить представление обо всех аспектах Azure Sentinel. С книгами можно выполнять целый ряд операций, и хотя предоставленные шаблоны являются отличной отправной точкой, вам, скорее всего, потребуется изучить и настроить эти шаблоны или создать новые панели мониторинга, объединяющие множество различных источников данных, чтобы вы могли визуализировать данные уникальным образом. Поскольку книги-Sentinel Azure основаны на Azure Monitor книгах, уже существует обширная документация и многие другие шаблоны. Лучше начать с этой статьи о [создании интерактивных отчетов с Azure Monitor книгами](../azure-monitor/platform/workbooks-overview.md). 

Существует также обширное сообщество [Azure Monitor книг на GitHub](https://github.com/microsoft/Application-Insights-Workbooks) , где можно скачать дополнительные шаблоны и включить в него собственные шаблоны.

## <a name="next-steps"></a>Дальнейшие шаги
В этом документе вы узнали о возможностях Azure Sentinel и новой колонке "аналитика угроз" для анализа угроз. Практические рекомендации по использованию функций анализа угроз Azure Sentinel см. в следующих статьях:

- [Подключение данных аналитики угроз](./connect-threat-intelligence.md) к Azure Sentinel.
- Создание [встроенных](./tutorial-detect-threats-built-in.md) или [пользовательских](./tutorial-detect-threats-custom.md) оповещений и [изучение](./tutorial-investigate-cases.md) инцидентов в Azure Sentinel.